greglandry/psoc_pong/pong_peripheral/main.c
/******************************************************************************
* File Name:   main.c
*
* Description: This file contains the main for the peripheral BLE pong game
*
* Related Document: See README.md
*
*
*******************************************************************************
* (c) 2019-2021, Cypress Semiconductor Corporation. All rights reserved.
*******************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Cypress Semiconductor Corporation or one of its
* subsidiaries ("Cypress") and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Cypress's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Cypress against all liability.
*******************************************************************************/

// MCU headers
#include "cy_pdl.h"
#include "cy_retarget_io.h"
#include "cybsp.h"
#include "cyhal.h"

// RTOS headers
#include "FreeRTOS.h"
#include "task.h"

// malloc and free
#include "stdlib.h"

// BT Stack
#include "wiced_bt_stack.h"

// BT app utils
#include "app_bt_utils.h"

// BT configurator generated headers
#include "cycfg_bt_settings.h"
#include "cycfg_gap.h"
#include "cycfg_gatt_db.h"

// Display headers
#include "GUI.h"
#include "cy8ckit_028_tft_pins.h"
#include "mtb_st7789v.h"

// Display task header file
#include "displayTask.h"

/*******************************************************************************
* Macros
********************************************************************************/
#define GPIO_INTERRUPT_PRIORITY (1u)

#define LED_ON_DUTY    (0.1)
#define LED_OFF_DUTY   (100)
#define LED_BLINK_DUTY (50)

// Typdef for function used to free allocated buffer to stack
typedef void (*pfn_free_buffer_t)(uint8_t *);

/*******************************************************************
 * Function Prototypes
 ******************************************************************/
/* Callback function for Bluetooth stack management type events */
static wiced_bt_dev_status_t app_bt_management_callback(wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data);

/* GATT Event Callback and Handler Functions */
static wiced_bt_gatt_status_t app_bt_gatt_event_callback(wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data);

static wiced_bt_gatt_status_t app_bt_connect_event_handler(wiced_bt_gatt_connection_status_t *p_conn_status);
static wiced_bt_gatt_status_t app_bt_server_event_handler(wiced_bt_gatt_event_data_t *p_data);

static wiced_bt_gatt_status_t app_bt_write_handler(wiced_bt_gatt_event_data_t *p_data);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_handler(uint16_t conn_id, wiced_bt_gatt_opcode_t opcode, wiced_bt_gatt_read_t *p_read_req,
														   uint16_t len_requested);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_multi_handler(uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
																 wiced_bt_gatt_read_multiple_req_t *p_read_req, uint16_t len_requested);
static wiced_bt_gatt_status_t app_bt_gatt_req_read_by_type_handler(uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
																   wiced_bt_gatt_read_by_type_t *p_read_req, uint16_t len_requested);
/* Helper functions to find GATT database handles and allocate/free buffers for GATT operations */
static gatt_db_lookup_table_t *app_bt_find_by_handle(uint16_t handle);
static uint8_t *app_bt_alloc_buffer(uint16_t len);
static void app_bt_free_buffer(uint8_t *p_data);

/*******************************************************************************
* Interrupt Service Routines
********************************************************************************/
// User button 1 interrupt handler
static void button1_isr(void *handler_arg, cyhal_gpio_event_t event) {
	if(gamePaddle.posY < SCREEN_MAX_Y - gamePaddle.dimY) {
		// Update paddle position
		gamePaddle.posY += 10;
	}
}

// User button 2 interrupt handler
static void button2_isr(void *handler_arg, cyhal_gpio_event_t event) {
	if(gamePaddle.posY > 0) {
		// Update paddle position
		gamePaddle.posY -= 10;
	}
}

/*******************************************************************************
* Global Vars
********************************************************************************/
/* Enable RTOS aware debugging in OpenOCD */
volatile int uxTopUsedPriority;

// User button 1 GPIO callback initialization structure
cyhal_gpio_callback_data_t btn1_cb_data = {.callback = button1_isr, .callback_arg = NULL};

