greglandry/psoc_pong/pong_peripheral/main.c
// User button 2 GPIO callback initialization structure
cyhal_gpio_callback_data_t btn2_cb_data = {.callback = button2_isr, .callback_arg = NULL};

// Pins for the TFT display
const mtb_st7789v_pins_t tft_pins = {.db08 = CY8CKIT_028_TFT_PIN_DISPLAY_DB8,
									 .db09 = CY8CKIT_028_TFT_PIN_DISPLAY_DB9,
									 .db10 = CY8CKIT_028_TFT_PIN_DISPLAY_DB10,
									 .db11 = CY8CKIT_028_TFT_PIN_DISPLAY_DB11,
									 .db12 = CY8CKIT_028_TFT_PIN_DISPLAY_DB12,
									 .db13 = CY8CKIT_028_TFT_PIN_DISPLAY_DB13,
									 .db14 = CY8CKIT_028_TFT_PIN_DISPLAY_DB14,
									 .db15 = CY8CKIT_028_TFT_PIN_DISPLAY_DB15,
									 .nrd = CY8CKIT_028_TFT_PIN_DISPLAY_NRD,
									 .nwr = CY8CKIT_028_TFT_PIN_DISPLAY_NWR,
									 .dc = CY8CKIT_028_TFT_PIN_DISPLAY_DC,
									 .rst = CY8CKIT_028_TFT_PIN_DISPLAY_RST};

// PWM for connection status LED
cyhal_pwm_t status_pwm_obj;

// BLE connection ID
uint16_t connection_id = 0;

// Defined in displayTasak.c
extern bool hasBall;

/******************************************************************************
 * Function Name: main
 ******************************************************************************
 * Summary:
 *  System entrance point. This function initializes HW, creates tasks,
 *  then starts the scheduler.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  int
 *
 ******************************************************************************/
int main(void) {
	/*******************************************************************************
    * HW Initialization
    ********************************************************************************/
	cy_rslt_t result;

	/* Initialize the device and board peripherals */
	result = cybsp_init();
	if(result != CY_RSLT_SUCCESS) {
		CY_ASSERT(0);
	}

	__enable_irq();

	/* Initialize PWM for connection status LED */
	cyhal_pwm_init(&status_pwm_obj, CYBSP_USER_LED2, NULL);
	cyhal_pwm_set_duty_cycle(&status_pwm_obj, LED_OFF_DUTY, 2);
	cyhal_pwm_start(&status_pwm_obj);

	/* Initialize retarget-io to use the debug UART port. */
	cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);

	/* Initialize the user button for moving the paddle right */
	result = cyhal_gpio_init(CYBSP_USER_BTN, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, CYBSP_BTN_OFF);
	/* GPIO init failed. Stop program execution */
	if(result != CY_RSLT_SUCCESS) {
		CY_ASSERT(0);
	}

	/* Initialize the user button for moving the paddle left */
	result = cyhal_gpio_init(CYBSP_USER_BTN2, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, CYBSP_BTN_OFF);
	/* GPIO init failed. Stop program execution */
	if(result != CY_RSLT_SUCCESS) {
		CY_ASSERT(0);
	}

	/* Configure GPIO interrupt for moving the paddle right*/
	cyhal_gpio_register_callback(CYBSP_USER_BTN, &btn1_cb_data);
	cyhal_gpio_enable_event(CYBSP_USER_BTN, CYHAL_GPIO_IRQ_FALL, GPIO_INTERRUPT_PRIORITY, true);
	Cy_GPIO_SetFilter(P0_4_PORT, P0_4_NUM);

	/* Configure GPIO interrupt for moving the paddle right*/
	cyhal_gpio_register_callback(CYBSP_USER_BTN2, &btn2_cb_data);
	cyhal_gpio_enable_event(CYBSP_USER_BTN2, CYHAL_GPIO_IRQ_FALL, GPIO_INTERRUPT_PRIORITY, true);
	Cy_GPIO_SetFilter(P1_4_PORT, P1_4_NUM);

	// Initialize the display
	mtb_st7789v_init8(&tft_pins);

	// Initialize the emwin library
	GUI_Init();

	// Clear the display
	GUI_Clear();

	/* \x1b[2J\x1b[;H - ANSI ESC sequence to clear screen. */
	printf("\x1b[2J\x1b[;H");
	printf("BLE Pong Peripheral\n");

	/*******************************************************************************
	* RTOS Initialization
	********************************************************************************/

	/* Configure platform specific settings for the BT device */
	cybt_platform_config_init(&cybsp_bt_platform_cfg);

	/* Initialize stack and register the callback function */
	wiced_bt_stack_init(app_bt_management_callback, &wiced_bt_cfg_settings);

	// Start the scheduler
	vTaskStartScheduler();

	/* Should never get here. */
	CY_ASSERT(0);
}

/*******************************************************************************
* Function Name: wiced_bt_dev_status_t app_bt_management_callback(
* 					wiced_bt_management_evt_t event,
* 					wiced_bt_management_evt_data_t *p_event_data )
********************************************************************************/
static wiced_result_t app_bt_management_callback(wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data) {
	/* Start in error state so that any unimplemented states will return error */
	wiced_result_t result = WICED_BT_ERROR;
	wiced_bt_device_address_t bda = {0};

	printf("Bluetooth Management Event: 0x%x %s\n", event, get_bt_event_name(event));

	switch(event) {
		case BTM_ENABLED_EVT:    // Bluetooth Controller and Host Stack Enabled
			if(WICED_BT_SUCCESS == p_event_data->enabled.status) {
				printf("Bluetooth Enabled\n");

				/* Set the local BDA from the value in the configurator and print it */
				wiced_bt_set_local_bdaddr((uint8_t *)cy_bt_device_address, BLE_ADDR_PUBLIC);
				wiced_bt_dev_read_local_addr(bda);
				printf("Local Bluetooth Device Address: ");
				print_bd_address(bda);

				/* Register GATT callback and initialize database*/
				wiced_bt_gatt_register(app_bt_gatt_event_callback);
				wiced_bt_gatt_db_init(gatt_database, gatt_database_len, NULL);

				/* Disable pairing */
				wiced_bt_set_pairable_mode(WICED_FALSE, WICED_FALSE);

				/* Set advertisement and scan response packets and begin advertising */
				wiced_bt_ble_set_raw_advertisement_data(CY_BT_ADV_PACKET_DATA_SIZE, cy_bt_adv_packet_data);

				wiced_bt_ble_set_raw_scan_response_data(CY_BT_SCAN_RESP_PACKET_DATA_SIZE, cy_bt_scan_resp_packet_data);

				wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH, 0, NULL);

				result = WICED_BT_SUCCESS;
			} else {
				printf("Failed to initialize Bluetooth controller and stack\n");
			}
			break;

		case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT:    // IO capabilities request
			result = WICED_BT_SUCCESS;
			break;

