greglandry/psoc_pong/pong_peripheral/main.c
		case BTM_PAIRING_COMPLETE_EVT:    // Pairing Complete event
			result = WICED_BT_SUCCESS;
			break;

		case BTM_ENCRYPTION_STATUS_EVT:    // Encryption Status Event
			result = WICED_BT_SUCCESS;
			break;

		case BTM_SECURITY_REQUEST_EVT:    // Security access
			result = WICED_BT_SUCCESS;
			break;

		case BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT:    // Save link keys with app
			result = WICED_BT_SUCCESS;
			break;

		case BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT:    // Retrieve saved link keys
														 /* This must return WICED_BT_ERROR if bonding information is not stored in EEPROM */
			result = WICED_BT_ERROR;
			break;

		case BTM_LOCAL_IDENTITY_KEYS_UPDATE_EVT:    // Save keys to NVRAM
			result = WICED_BT_SUCCESS;
			break;

		case BTM_LOCAL_IDENTITY_KEYS_REQUEST_EVT:    // Read keys from NVRAM
													 /* This should return WICED_BT_SUCCESS if not using privacy. If RPA is enabled but keys are not
               stored in EEPROM, this must return WICED_BT_ERROR so that the stack will generate new privacy keys */
			result = WICED_BT_SUCCESS;
			break;
		case BTM_BLE_SCAN_STATE_CHANGED_EVT:    // Scan State Change
			result = WICED_BT_SUCCESS;
			break;

		case BTM_BLE_ADVERT_STATE_CHANGED_EVT:    // Advertising State Change
			printf("Advertisement State Change: %s\n", get_bt_advert_mode_name(p_event_data->ble_advert_state_changed));
			if(p_event_data->ble_advert_state_changed == BTM_BLE_ADVERT_OFF) /* Advertising stopped */
			{
				if(0 == connection_id) /* not connected  - LED off */
				{
					cyhal_pwm_set_duty_cycle(&status_pwm_obj, LED_OFF_DUTY, 2);
					GUI_Clear();                        // Clear the display
					GUI_SetFont(&GUI_Font32B_ASCII);    // Font size
					GUI_DispString("Disconnected");     // Display advertising message

				} else /* connected - LED on */
				{
					cyhal_pwm_set_duty_cycle(&status_pwm_obj, LED_ON_DUTY, 2);
					GUI_Clear();                                       // Clear the display
					GUI_SetFont(&GUI_Font32B_ASCII);                   // Font size
					GUI_DispString("Connected!\nStarting Game...");    // Display advertising message
				}
			} else /* Advertising is on - LED blink */
			{
				cyhal_pwm_set_duty_cycle(&status_pwm_obj, LED_BLINK_DUTY, 2);    // LED blinks when advertising
				GUI_Clear();                                                     // Clear the display
				GUI_SetFont(&GUI_Font32B_ASCII);                                 // Font size
				GUI_DispString("Advertising");                                   // Display advertising message
			}

			result = WICED_BT_SUCCESS;
			break;

		default: break;
	}

	return result;
}

/*******************************************************************************
* Function Name: wiced_bt_gatt_status_t app_bt_gatt_event_callback(
* 					wiced_bt_gatt_evt_t event,
* 					wiced_bt_gatt_event_data_t *p_data )
********************************************************************************/
static wiced_bt_gatt_status_t app_bt_gatt_event_callback(wiced_bt_gatt_evt_t event, wiced_bt_gatt_event_data_t *p_event_data) {
	/* Start in error state so that any unimplemented states will return error */
	wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;

	/* Call the appropriate callback function based on the GATT event type, and pass the relevant event
     * parameters to the callback function */
	switch(event) {
		case GATT_CONNECTION_STATUS_EVT: status = app_bt_connect_event_handler(&p_event_data->connection_status); break;

		case GATT_ATTRIBUTE_REQUEST_EVT: status = app_bt_server_event_handler(p_event_data); break;

		case GATT_GET_RESPONSE_BUFFER_EVT: /* GATT buffer request, typically sized to max of bearer mtu - 1 */
			p_event_data->buffer_request.buffer.p_app_rsp_buffer = app_bt_alloc_buffer(p_event_data->buffer_request.len_requested);
			p_event_data->buffer_request.buffer.p_app_ctxt = (void *)app_bt_free_buffer;
			status = WICED_BT_GATT_SUCCESS;
			break;

		case GATT_APP_BUFFER_TRANSMITTED_EVT: /* GATT buffer transmitted event,  check \ref wiced_bt_gatt_buffer_transmitted_t*/
		{
			pfn_free_buffer_t pfn_free = (pfn_free_buffer_t)p_event_data->buffer_xmitted.p_app_ctxt;

			/* If the buffer is dynamic, the context will point to a function to free it. */
			if(pfn_free) {
				pfn_free(p_event_data->buffer_xmitted.p_app_data);
			}
			status = WICED_BT_GATT_SUCCESS;
		} break;

		default:
			printf("Unhandled GATT Event: 0x%x (%d)\n", event, event);
			status = WICED_BT_GATT_SUCCESS;
			break;
	}

	return status;
}

/*******************************************************************************
 * Function Name: app_bt_connect_event_handler
 *
 * Handles GATT connection status changes.
 *
 * Param:	p_conn_status  Pointer to data that has connection details
 * Return:	wiced_bt_gatt_status_t
 * See possible status codes in wiced_bt_gatt_status_e in wiced_bt_gatt.h
*******************************************************************************/
static wiced_bt_gatt_status_t app_bt_connect_event_handler(wiced_bt_gatt_connection_status_t *p_conn_status) {
	wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;

	if(NULL != p_conn_status) {
		if(p_conn_status->connected) {
			printf("GATT_CONNECTION_STATUS_EVT: Connect BDA ");
			print_bd_address(p_conn_status->bd_addr);
			printf("Connection ID %d\n", p_conn_status->conn_id);

			/* Handle the connection */
			connection_id = p_conn_status->conn_id;

			cyhal_pwm_set_duty_cycle(&status_pwm_obj, LED_ON_DUTY, 2);    // LED Solid when connected

			// Start the game
			/* Create the display task. */
			xTaskCreate(displayTask, "Display task", DISPLAY_TASK_STACK_SIZE, NULL, DISPLAY_TASK_PRIORITY, &display_task_handle);
		} else {
			/* Handle the disconnection */
			printf("Disconnected : BDA ");
			print_bd_address(p_conn_status->bd_addr);
			printf("Connection ID '%d', Reason '%s'\n", p_conn_status->conn_id, get_bt_gatt_disconn_reason_name(p_conn_status->reason));
			connection_id = 0;

			cyhal_pwm_set_duty_cycle(&status_pwm_obj, LED_OFF_DUTY, 2);    // LED off when connected
			GUI_Clear();                                                   // Clear the display
			GUI_SetFont(&GUI_Font32B_ASCII);                               // Font size
			GUI_DispString("Disconnected");                                // Display disconnected message
		}

		status = WICED_BT_GATT_SUCCESS;
	}

