greglandry/psoc_pong/pong_peripheral/main.c
	return status;
}

/*******************************************************************************
 * Function Name: app_bt_server_event_handler
 *
 * Invoked when GATT_ATTRIBUTE_REQUEST_EVT occurs in GATT Event callback.
 *
 * Param:	p_data   				Pointer to BLE GATT request data
 * Return:	wiced_bt_gatt_status_t  BLE GATT status
*******************************************************************************/
static wiced_bt_gatt_status_t app_bt_server_event_handler(wiced_bt_gatt_event_data_t *p_data) {
	wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;
	wiced_bt_gatt_attribute_request_t *p_att_req = &p_data->attribute_request;

	switch(p_att_req->opcode) {
		case GATT_REQ_READ: /* Attribute read notification (attribute value internally read from GATT database) */
		case GATT_REQ_READ_BLOB:
			status = app_bt_gatt_req_read_handler(p_att_req->conn_id, p_att_req->opcode, &p_att_req->data.read_req, p_att_req->len_requested);
			break;

		case GATT_REQ_READ_BY_TYPE:
			status =
			app_bt_gatt_req_read_by_type_handler(p_att_req->conn_id, p_att_req->opcode, &p_att_req->data.read_by_type, p_att_req->len_requested);
			break;

		case GATT_REQ_READ_MULTI:
		case GATT_REQ_READ_MULTI_VAR_LENGTH:
			status =
			app_bt_gatt_req_read_multi_handler(p_att_req->conn_id, p_att_req->opcode, &p_att_req->data.read_multiple_req, p_att_req->len_requested);
			break;

		case GATT_REQ_WRITE:
		case GATT_CMD_WRITE:
		case GATT_CMD_SIGNED_WRITE:
			status = app_bt_write_handler(p_data);
			if((p_att_req->opcode == GATT_REQ_WRITE) && (status == WICED_BT_GATT_SUCCESS)) {
				wiced_bt_gatt_write_req_t *p_write_request = &p_att_req->data.write_req;
				wiced_bt_gatt_server_send_write_rsp(p_att_req->conn_id, p_att_req->opcode, p_write_request->handle);
				printf("Write response sent!\n");
			}
			break;

		case GATT_REQ_PREPARE_WRITE: status = WICED_BT_GATT_SUCCESS; break;

		case GATT_REQ_EXECUTE_WRITE:
			wiced_bt_gatt_server_send_execute_write_rsp(p_att_req->conn_id, p_att_req->opcode);
			status = WICED_BT_GATT_SUCCESS;
			break;

		case GATT_REQ_MTU:
			/* Application calls wiced_bt_gatt_server_send_mtu_rsp() with the desired mtu */
			status =
			wiced_bt_gatt_server_send_mtu_rsp(p_att_req->conn_id, p_att_req->data.remote_mtu, wiced_bt_cfg_settings.p_ble_cfg->ble_max_rx_pdu_size);
			break;

		case GATT_HANDLE_VALUE_CONF: /* Value confirmation */ break;

		case GATT_HANDLE_VALUE_NOTIF: break;

		default: printf("Unhandled GATT Server Event: 0x%x (%d)\n", p_att_req->opcode, p_att_req->opcode); break;
	}

	return status;
}

/*******************************************************************************
 * Function Name: app_bt_write_handler
 *
 * Invoked when GATTS_REQ_TYPE_WRITE is received from the
 * client device. Handles "Write Requests" received from Client device.
 *
 * Param:	p_write_req   			Pointer to BLE GATT write request
 * Return:	wiced_bt_gatt_status_t  BLE GATT status
*******************************************************************************/
static wiced_bt_gatt_status_t app_bt_write_handler(wiced_bt_gatt_event_data_t *p_data) {
	wiced_bt_gatt_write_req_t *p_write_req = &p_data->attribute_request.data.write_req;
	;

	wiced_bt_gatt_status_t status = WICED_BT_GATT_INVALID_HANDLE;

	printf("WRITE REQUEST RECEIVED!\n");

	for(int i = 0; i < app_gatt_db_ext_attr_tbl_size; i++) {
		/* Check for a matching handle entry */
		if(app_gatt_db_ext_attr_tbl[i].handle == p_write_req->handle) {
			/* Detected a matching handle in the external lookup table */
			if(app_gatt_db_ext_attr_tbl[i].max_len >= p_write_req->val_len) {
				/* Value fits within the supplied buffer; copy over the value */
				app_gatt_db_ext_attr_tbl[i].cur_len = p_write_req->val_len;
				memset(app_gatt_db_ext_attr_tbl[i].p_data, 0x00, app_gatt_db_ext_attr_tbl[i].max_len);
				memcpy(app_gatt_db_ext_attr_tbl[i].p_data, p_write_req->p_val, app_gatt_db_ext_attr_tbl[i].cur_len);

				if(memcmp(app_gatt_db_ext_attr_tbl[i].p_data, p_write_req->p_val, app_gatt_db_ext_attr_tbl[i].cur_len) == 0) {
					status = WICED_BT_GATT_SUCCESS;
				}

				switch(p_write_req->handle) {
					case HDLC_PONG_BALL_VALUE:    // Write To ball value occurred
						gameBall.posX = app_pong_ball[1];
						gameBall.posX = gameBall.posX << 8;
						gameBall.posX |= app_pong_ball[0];
						gameBall.posY = app_pong_ball[3];
						gameBall.posY = gameBall.posY << 8;
						gameBall.posY |= app_pong_ball[2];
						gameBall.speedX = app_pong_ball[5];
						gameBall.speedX = gameBall.speedX << 8;
						gameBall.speedX |= app_pong_ball[4];
						gameBall.speedY = app_pong_ball[7];
						gameBall.speedY = gameBall.speedY << 8;
						gameBall.speedY |= app_pong_ball[6];
						printf("Game Ball Data Received via Write:\nposX: %d\nposY: %d\nspeedX: %d\nspeedY: %d\n", gameBall.posX, gameBall.posY,
							   gameBall.speedX, gameBall.speedY);
						hasBall = true;
						break;
				}
			} else {
				/* Value to write will not fit within the table */
				status = WICED_BT_GATT_INVALID_ATTR_LEN;
				printf("Invalid attribute length during GATT write\n");
			}
			break;
		}
	}
	if(WICED_BT_GATT_SUCCESS != status) {
		printf("GATT write failed: %d\n", status);
	}

	return status;
}

/*******************************************************************************
 * Function Name: app_bt_gatt_req_read_handler
 *
 * This Function handles GATT read and read blob events
 *
 * Params: 	conn_id       			Connection ID
 * 			opcode        			BLE GATT request type opcode
 * 			p_read_req    			Pointer to read request containing the handle to read
 * 			len_requested 			Length of data requested
 * Return: 	wiced_bt_gatt_status_t  BLE GATT status
*******************************************************************************/
static wiced_bt_gatt_status_t app_bt_gatt_req_read_handler(uint16_t conn_id, wiced_bt_gatt_opcode_t opcode, wiced_bt_gatt_read_t *p_read_req,
														   uint16_t len_requested) {
	gatt_db_lookup_table_t *puAttribute;
	uint16_t attr_len_to_copy, to_send;
	uint8_t *from;

	if((puAttribute = app_bt_find_by_handle(p_read_req->handle)) == NULL) {
		wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, p_read_req->handle, WICED_BT_GATT_INVALID_HANDLE);
		return WICED_BT_GATT_INVALID_HANDLE;
	}

	attr_len_to_copy = puAttribute->cur_len;

	if(p_read_req->offset >= puAttribute->cur_len) {
		wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, p_read_req->handle, WICED_BT_GATT_INVALID_OFFSET);
		return WICED_BT_GATT_INVALID_OFFSET;
	}

