greglandry/psoc_pong/pong_peripheral/main.c
	switch(p_read_req->handle) {
		case HDLC_PONG_BALL:
			// Read Action
			break;
	}

	to_send = MIN(len_requested, attr_len_to_copy - p_read_req->offset);
	from = puAttribute->p_data + p_read_req->offset;
	return wiced_bt_gatt_server_send_read_handle_rsp(conn_id, opcode, to_send, from, NULL); /* No need for context, as buff not allocated */
}

/*******************************************************************************
 * Function Name: app_bt_gatt_req_read_by_type_handler
 *
 * Process read-by-type request from peer device
 *
 * Params:	conn_id       			Connection ID
 * 			opcode        			BLE GATT request type opcode
 * 			p_read_req    			Pointer to read request containing the handle to read
 * 			len_requested 			Length of data requested
 * Return:	wiced_bt_gatt_status_t	BLE GATT status
*******************************************************************************/
static wiced_bt_gatt_status_t app_bt_gatt_req_read_by_type_handler(uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
																   wiced_bt_gatt_read_by_type_t *p_read_req, uint16_t len_requested) {
	gatt_db_lookup_table_t *puAttribute;
	uint16_t attr_handle = p_read_req->s_handle;
	uint8_t *p_rsp = app_bt_alloc_buffer(len_requested);
	uint8_t pair_len = 0;
	int used = 0;

	if(p_rsp == NULL) {
		wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, attr_handle, WICED_BT_GATT_INSUF_RESOURCE);
		return WICED_BT_GATT_INSUF_RESOURCE;
	}

	/* Read by type returns all attributes of the specified type, between the start and end handles */
	while(WICED_TRUE) {
		attr_handle = wiced_bt_gatt_find_handle_by_type(attr_handle, p_read_req->e_handle, &p_read_req->uuid);

		if(attr_handle == 0)
			break;

		if((puAttribute = app_bt_find_by_handle(attr_handle)) == NULL) {
			wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, p_read_req->s_handle, WICED_BT_GATT_ERR_UNLIKELY);
			app_bt_free_buffer(p_rsp);
			return WICED_BT_GATT_INVALID_HANDLE;
		}

		{
			int filled = wiced_bt_gatt_put_read_by_type_rsp_in_stream(p_rsp + used, len_requested - used, &pair_len, attr_handle,
																	  puAttribute->cur_len, puAttribute->p_data);
			if(filled == 0) {
				break;
			}
			used += filled;
		}

		/* Increment starting handle for next search to one past current */
		attr_handle++;
	}

	if(used == 0) {
		wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, p_read_req->s_handle, WICED_BT_GATT_INVALID_HANDLE);
		app_bt_free_buffer(p_rsp);
		return WICED_BT_GATT_INVALID_HANDLE;
	}

	switch(p_read_req->s_handle) {
		case HDLC_PONG_BALL:
			// Read by type action
			break;
	}

	/* Send the response */
	wiced_bt_gatt_server_send_read_by_type_rsp(conn_id, opcode, pair_len, used, p_rsp, (void *)app_bt_free_buffer);

	return WICED_BT_GATT_SUCCESS;
}

/*******************************************************************************
 * Function Name: app_bt_gatt_req_read_multi_handler
 *
 * Process write read multi request from peer device
 *
 * Params:	conn_id       			Connection ID
 * 			opcode        			BLE GATT request type opcode
 * 			p_read_req    			Pointer to read request containing the handle to read
 * 			len_requested 			Length of data requested
 * Return:	wiced_bt_gatt_status_t  BLE GATT status
*******************************************************************************/
static wiced_bt_gatt_status_t app_bt_gatt_req_read_multi_handler(uint16_t conn_id, wiced_bt_gatt_opcode_t opcode,
																 wiced_bt_gatt_read_multiple_req_t *p_read_req, uint16_t len_requested) {
	gatt_db_lookup_table_t *puAttribute;
	uint8_t *p_rsp = app_bt_alloc_buffer(len_requested);
	int used = 0;
	int xx;
	uint16_t handle = wiced_bt_gatt_get_handle_from_stream(p_read_req->p_handle_stream, 0);

	if(p_rsp == NULL) {
		wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, handle, WICED_BT_GATT_INSUF_RESOURCE);
		return WICED_BT_GATT_INVALID_HANDLE;
	}

	/* Read by type returns all attributes of the specified type, between the start and end handles */
	for(xx = 0; xx < p_read_req->num_handles; xx++) {
		handle = wiced_bt_gatt_get_handle_from_stream(p_read_req->p_handle_stream, xx);
		if((puAttribute = app_bt_find_by_handle(handle)) == NULL) {
			wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, *p_read_req->p_handle_stream, WICED_BT_GATT_ERR_UNLIKELY);
			app_bt_free_buffer(p_rsp);
			return WICED_BT_GATT_ERR_UNLIKELY;
		}

		{
			int filled = wiced_bt_gatt_put_read_multi_rsp_in_stream(opcode, p_rsp + used, len_requested - used, puAttribute->handle,
																	puAttribute->cur_len, puAttribute->p_data);
			if(!filled) {
				break;
			}
			used += filled;
		}
	}

	if(used == 0) {
		wiced_bt_gatt_server_send_error_rsp(conn_id, opcode, *p_read_req->p_handle_stream, WICED_BT_GATT_INVALID_HANDLE);
		return WICED_BT_GATT_INVALID_HANDLE;
	}

	switch(*p_read_req->p_handle_stream) {
		case HDLC_PONG_BALL:
			// Multi read action
			break;
	}

	/* Send the response */
	wiced_bt_gatt_server_send_read_multiple_rsp(conn_id, opcode, used, p_rsp, (void *)app_bt_free_buffer);

	return WICED_BT_GATT_SUCCESS;
}

/*******************************************************************************
* Function Name: app_bt_find_by_handle
*
* Finds attribute location by handle
*
* Param:  handle    				handle to look up
* Return: gatt_db_lookup_table_t   	pointer to location containing handle data
********************************************************************************/
static gatt_db_lookup_table_t *app_bt_find_by_handle(uint16_t handle) {
	int i;
	for(i = 0; i < app_gatt_db_ext_attr_tbl_size; i++) {
		if(app_gatt_db_ext_attr_tbl[i].handle == handle) {
			return (&app_gatt_db_ext_attr_tbl[i]);
		}
	}
	return NULL;
}

/*******************************************************************************
* Function Name: app_bt_alloc_buffer
*
* This Function allocates the buffer of requested length
*
* Param:  len			Length of buffer
* Return: uint8_t*      Pointer to allocated buffer
********************************************************************************/
static uint8_t *app_bt_alloc_buffer(uint16_t len) {
	uint8_t *p = (uint8_t *)malloc(len);
	return p;
}

/*******************************************************************************
* Function Name: app_bt_free_buffer
*
* This Function frees the buffer requested
*
* Param:  p_data		Pointer to buffer to be freed
********************************************************************************/
static void app_bt_free_buffer(uint8_t *p_data) {
	if(p_data != NULL) {
		free(p_data);
	}
}
/* [] END OF FILE */
